zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/k2x/pinctrl/MK22FX512VLL12-pinctrl.h
/*
 * NOTE: Autogenerated file by kinetis_cfg_utils.py
 * for MK22FX512VLL12/signal_configuration.xml
 *
 * Copyright 2023 Daniel DeGrasse
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MK24FN256VDC12-pinctrl.h with this part's differences applied
 * below (55 removed, 0 changed,
 * 21 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 29a4bf770d72f0ae
 */

#ifndef _ZEPHYR_DTS_BINDING_MK22FX512VLL12_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MK22FX512VLL12_WRAPPER_

#include "MK24FN256VDC12-pinctrl.h"

/* Signals not present on this part */
#undef ADC1_SE12_PTB6
#undef ADC1_SE13_PTB7
#undef FTM0_CH4_PTB12
#undef FTM0_CH5_PTB13
#undef FTM1_CH0_PTB12
#undef FTM1_CH1_PTB13
#undef FTM1_QD_PHA_PTB12
#undef FTM1_QD_PHB_PTB13
#undef FTM2_CH0_PTA10
#undef FTM2_CH1_PTA11
#undef FTM2_QD_PHA_PTA10
#undef FTM2_QD_PHB_PTA11
#undef FTM3_FLT0_PTD12
#undef FTM_CLKIN0_PTC12
#undef FTM_CLKIN1_PTC13
#undef I2C0_SCL_PTD8
#undef I2C0_SCL_PTE24
#undef I2C0_SDA_PTD9
#undef I2C0_SDA_PTE25
#undef I2C2_SDA_PTA11
#undef PTA10
#undef PTA11
#undef PTA29
#undef PTB12
#undef PTB13
#undef PTB6
#undef PTB7
#undef PTB8
#undef PTC19
#undef PTD10
#undef PTD11
#undef PTD12
#undef PTD13
#undef PTD14
#undef PTD15
#undef PTD8
#undef PTD9
#undef SPI1_PCS0_PTD4
#undef SPI1_SCK_PTD5
#undef SPI1_SIN_PTD7
#undef SPI1_SOUT_PTD6
#undef SPI2_PCS0_PTD11
#undef SPI2_PCS1_PTD15
#undef SPI2_SCK_PTD12
#undef SPI2_SIN_PTD14
#undef SPI2_SOUT_PTD13
#undef UART3_CTS_b_PTB13
#undef UART3_CTS_b_PTC19
#undef UART3_RTS_b_PTB12
#undef UART3_RTS_b_PTB8
#undef UART5_CTS_b_PTD11
#undef UART5_RTS_b_PTD10
#undef UART5_RX_PTD8
#undef UART5_TX_PTD9
#undef USB_SOF_OUT_PTC0

/* Signals specific to this part */
#define ADC0_DM2_PTE3 KINETIS_MUX('E',3,0)
#define ADC0_DP2_PTE2 KINETIS_MUX('E',2,0)
#define CAN0_RX_PTA13 KINETIS_MUX('A',13,2)
#define CAN0_RX_PTB19 KINETIS_MUX('B',19,2)
#define CAN0_TX_PTA12 KINETIS_MUX('A',12,2)
#define CAN0_TX_PTB18 KINETIS_MUX('B',18,2)
#define CMP2_IN0_PTA12 KINETIS_MUX('A',12,0)
#define CMP2_IN1_PTA13 KINETIS_MUX('A',13,0)
#define CMP2_OUT_PTA5 KINETIS_MUX('A',5,5)
#define CMP2_OUT_PTB22 KINETIS_MUX('B',22,6)
#define SDHC0_CMD_PTE3 KINETIS_MUX('E',3,4)
#define SDHC0_D0_PTE1 KINETIS_MUX('E',1,4)
#define SDHC0_D1_PTE0 KINETIS_MUX('E',0,4)
#define SDHC0_D2_PTE5 KINETIS_MUX('E',5,4)
#define SDHC0_D3_PTE4 KINETIS_MUX('E',4,4)
#define SDHC0_DCLK_PTE2 KINETIS_MUX('E',2,4)
#define TRACE_CLKOUT_PTE0 KINETIS_MUX('E',0,5)
#define TRACE_D0_PTE4 KINETIS_MUX('E',4,5)
#define TRACE_D1_PTE3 KINETIS_MUX('E',3,5)
#define TRACE_D2_PTE2 KINETIS_MUX('E',2,5)
#define TRACE_D3_PTE1 KINETIS_MUX('E',1,5)

#endif /* _ZEPHYR_DTS_BINDING_MK22FX512VLL12_WRAPPER_ */
